#!/usr/bin/env python
# coding: utf-8

# In[2]:


import requests
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
import json


# In[3]:


url = 'http://apis.data.go.kr/B552061/AccidentDeath/getRestTrafficAccidentDeath'

servicekey = 'DabzRHmcywzOD2+/wW45U05QU9qFYv/tNYlMz8YEw7ZiBveoPe+x2jYjh3ctcaM7kMWwJoKlAzUNVlFtYzam7A=='

searchYear = ['2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019', '2020']

sido = {
    '1100' : '서울특별시',
    '1200' : '부산광역시',
    '1300' : '경기도',
    '1400' : '강원도',
    '1500' : '충청북도',
    '1600' : '충청남도',
    '1700' : '전라북도 ',
    '1800' : '전라남도',
    '1900' : '경상북도 ',
    '2000' : '경상남도 ',
    '2100' : '제주특별자치도',
    '2200' : '대구광역시',
    '2300' : '인천광역시',
    '2400' : '광주광역시',
    '2500' : '대전광역시',
    '2600' : '울산광역시',
    '2700' : '세종특별자치시'
}

guGun = {
    '1101': '종로구',
    '1102': '중구',
    '1103': '용산구',
    '1104': '성동구',
    '1105': '동대문구',
    '1106': '성북구',
    '1107': '도봉구',
    '1108': '은평구',
    '1109': '서대문구',
    '1110': '마포구',
    '1111': '강서구',
    '1112': '구로구',
    '1113': '영등포구',
    '1114': '동작구',
    '1115': '관악구',
    '1116': '강남구',
    '1117': '강동구',
    '1118': '송파구',
    '1119': '서초구',
    '1120': '양천구',
    '1121': '중랑구',
    '1122': '노원구',
    '1123': '광진구',
    '1124': '강북구',
    '1125': '금천구',
    '1212': '강서구',
    '1211': '금정구',
    '1216': '기장군',
    '1207': '남구',
    '1203': '동구',
    '1206': '동래구',
    '1208': '북구',
    '1215': '사상구',
    '1210': '사하구',
    '1202': '서구',
    '1214': '수영구',
    '1213': '연제구',
    '1204': '영도구',
    '1201': '중구',
    '1205': '진구',
    '1209': '해운대구',
    '1322': '가평군',
    '1318': '고양시',
    '1332': '과천시',
    '1309': '광명시',
    '1319': '광주시',
    '1310': '구리시',
    '1333': '군포시',
    '1327': '김포시',
    '1334': '남양주시',
    '1330': '동두천시',
    '1306': '부천시',
    '1303': '성남시',
    '1302': '수원시',
    '1316': '시흥시',
    '1307': '안산시',
    '1326': '안성시',
    '1305': '안양시',
    '1311': '양주시',
    '1323': '양평군',
    '1313': '여주시',
    '1320': '연천군',
    '1335': '오산시',
    '1325': '용인시',
    '1336': '의왕시',
    '1304': '의정부시',
    '1324': '이천시',
    '1317': '파주시',
    '1308': '평택시',
    '1321': '포천시',
    '1337': '하남시',
    '1315': '화성시',
    '2204': '남구',
    '2207': '달서구',
    '2208': '달성군',
    '2202': '동구',
    '2205': '북구',
    '2203': '서구',
    '2206': '수성구',
    '2201': '중구',
    '2309': '강화군',
    '2308': '계양구',
    '2303': '미추홀구',
    '2305': '남동구',
    '2302': '동구',
    '2304': '부평구',
    '2306': '서구',
    '2307': '연수구',
    '2310': '옹진군',
    '2301': '중구',
    '2404': '광산구',
    '2405': '남구',
    '2401': '동구',
    '2403': '북구',
    '2402': '서구',
    '2505': '대덕구',
    '2501': '동구',
    '2503': '서구',
    '2504': '유성구',
    '2502': '중구',
    '2602': '남구',
    '2603': '동구',
    '2604': '북구',
    '2605': '울주군',
    '2601': '중구',
    '2701': '세종특별자치시',
    '1404': '강릉시',
    '1422': '고성군',
    '1403': '동해시',
    '1407': '삼척시',
    '1405': '속초시',
    '1420': '양구군',
    '1423': '양양군',
    '1415': '영월군',
    '1402': '원주시',
    '1421': '인제군',
    '1417': '정선군',
    '1418': '철원군',
    '1401': '춘천시',
    '1406': '태백시',
    '1416': '평창군',
    '1412': '홍천군',
    '1419': '화천군',
    '1413': '횡성군',
    '1516': '괴산군',
    '1520': '단양군',
    '1512': '보은군',
    '1514': '영동군',
    '1513': '옥천군',
    '1517': '음성군',
    '1503': '제천시',
    '1521': '증평군',
    '1515': '진천군',
    '1511': '청원군',
    '1501': '청주시',
    '1502': '충주시',
    '1624': '계룡시',
    '1605': '공주시',
    '1611': '금산군',
    '1615': '논산시',
    '1623': '당진시',
    '1604': '보령시',
    '1616': '부여군',
    '1606': '서산시',
    '1617': '서천군',
    '1603': '아산시',
    '1613': '연기군',
    '1621': '예산군',
    '1602': '천안시',
    '1619': '청양군',
    '1612': '태안군',
    '1620': '홍성군',
    '1719': '고창군',
    '1702': '군산시',
    '1706': '김제시',
    '1705': '남원시',
    '1713': '무주군',
    '1720': '부안군',
    '1717': '순창군',
    '1711': '완주군',
    '1723': '익산시',
    '1715': '임실군',
    '1714': '장수군',
    '1701': '전주시',
    '1704': '정읍시',
    '1712': '진안군',
    '1822': '강진군',
    '1818': '고흥군',
    '1813': '곡성군',
    '1808': '광양시',
    '1814': '구례군',
    '1806': '나주시',
    '1812': '담양군',
    '1802': '목포시',
    '1825': '무안군',
    '1819': '보성군',
    '1804': '순천시',
    '1832': '신안군',
    '1803': '여수시',
    '1828': '영광군',
    '1824': '영암군',
    '1830': '완도군',
    '1829': '장성군',
    '1821': '장흥군',
    '1831': '진도군',
    '1827': '함평군',
    '1823': '해남군',
    '1820': '화순군',
    '1935': '경산시',
    '1903': '경주시',
    '1923': '고령군',
    '1906': '구미시',
    '1912': '군위군',
    '1904': '김천시',
    '1909': '문경시',
    '1932': '봉화군',
    '1910': '상주시',
    '1924': '성주군',
    '1905': '안동시',
    '1917': '영덕군',
    '1916': '영양군',
    '1907': '영주시',
    '1908': '영천시',
    '1930': '예천군',
    '1934': '울릉군',
    '1933': '울진군',
    '1913': '의성군',
    '1922': '청도군',
    '1915': '청송군',
    '1925': '칠곡군',
    '1902': '포항시',
    '2010': '거제시',
    '2028': '거창군',
    '2022': '고성군',
    '2008': '김해시',
    '2024': '남해군',
    '2001': '마산시',
    '2009': '밀양시',
    '2023': '사천시',
    '2026': '산청군',
    '2016': '양산시',
    '2012': '의령군',
    '2003': '진주시',
    '2005': '진해시',
    '2014': '창녕군',
    '2004': '창원시',
    '2030': '창원시(통합)',
    '2006': '통영시',
    '2025': '하동군',
    '2013': '함안군',
    '2027': '함양군',
    '2029': '합천군',
    '2102': '서귀포시',
    '2101': '제주시',
}


# In[4]:


df = pd.DataFrame()
for year in searchYear:
    print(f'{year}년도 데이터를 수집합니다.')
    for guGun in range(1101, 1126):
        params = {
                'serviceKey' : servicekey,
                'searchYear' : year, 
                'siDo' : str(guGun)[0:2] + '00', 
                'guGun' : str(guGun), 
                'type' : 'json', 
                'numOfRows' : '1000',
                'pageNo' : '1' 
        }
        response = requests.get(url, params=params)
        json_object = response.json()
        _df = pd.json_normalize(json_object['items']['item'])
        df = pd.concat([df, _df], ignore_index=True)


# In[5]:


df.to_csv('./output/traffic_accident.csv', index = False)


# In[6]:


df.info()


# In[ ]:




